Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: གང་ཀུན་ནས་ཉོན་མི་མོངས་པ་དེ་མི་རྩོད་དོ། །
en: One who is not defiled does not get into conflict.

source: གང་མི་རྩོད་པ་དེ་མི་བཟོད་དོ། །
en: One who does not get into conflict does not endure.

source: གང་མི་བཟོད་པ་དེ་རྨ་མི་ཕྱིན་ཏོ། །
en: One who does not endure is not wounded.

source: གང་རྨ་མི་ཕྱིན་པ་དེ་མི་འཇུག་མི་ལྡོག་སྟེ། དེ་ནི་ཕྱིར་མི་ལྡོག་པ་ལགས་སོ། །
en: One who is not wounded does not engage or reject, and so is irreversible.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པ་འདི་ནི་བཅོམ་ལྡན་འདས་ཆོས་ལགས་ཏེ།
en: Blessed One, the thus-gone ones prophesy the unsurpassable, completely perfect awakening of a bodhisattva who is irreversible.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ནི་ཕྱིར་མི་ལྡོག་པ་སྟེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་སྙམ་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པས་ལུང་མི་སྟོན་ཏོ། །
en: “Furthermore, Blessed One, if bodhisattvas think, ‘I am irreversible and will completely awaken to unsurpassable, completely perfect awakening,’ they are not prophesied by the thus-gone ones.

source: བཅོམ་ལྡན་འདས་འདོད་པ་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་རྩ་བ་ལགས་པའི་སླད་དུའོ། །
en: Because, Blessed One, desire is the root of all afflictive emotions.

source: བཅོམ་ལྡན་འདས་འདོད་པ་དང་བྲལ་ན་ཉོན་མོངས་པ་དང་བྲལ་ཏེ།
en: Blessed One, if bodhisattvas are free of desire, they are free of the afflictive emotions.

source: ཉོན་མོངས་པ་དང་བྲལ་བ་ལ་ལུང་སྟོན་ཏོ། །
en: Those who are free of afflictive emotions are prophesied.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་འཇིག་རྟེན་དང་མི་འཐུན་པ་སྨྲ་བ་ནི་ལུང་བསྟན་པའོ་སྙམ་དུ་སེམས་སོ། །
en: “Furthermore, Blessed One, bodhisattvas think, ‘Prophesy is speech that does not accord with the world.’

source: གང་ལུང་བསྟན་པ་དེ་ནི་འདི་ལ་མ་མཆིས་ཏེ། གང་ལུང་སྟོན་པ་དེ་ཡང་དེ་བཞིན་དུ་མ་མཆིས་སོ། །
en: The one who is prophesied does not exist, and the one who makes the prophesy likewise does not exist.

source: གལ་ཏེ་གང་ལུང་བསྟན་པ་དེ་ཡང་མ་མཆིས། གང་ལུང་སྟོན་པ་དེ་ཡང་དེ་བཞིན་དུ་མ་མཆིས་ན་འདི་ལ་ལུང་བསྟན་པར་ག་ལ་འགྱུར།
en: If the one who is prophesied does not exist and the one who makes the prophesy likewise does not exist, where could there be a prophesy?

source: གཞན་དུ་ན་བཅོམ་ལྡན་འདས་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པ་ནི་འདི་སྐད་དུ། སངས་རྒྱས་སུ་འགྱུར་ཞེས་གསུང་ངོ་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་དེ་ལྟར་ཤེས་པ་དེ་ལ་ལུང་སྟོན་ཏོ། །
en: Rather, a prophecy is given to a bodhisattva who thinks that the Blessed One, possessing great compassion, says in accord with the world, “You will become a buddha!” and understands that to be the case.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: “Blessed One, consider this example.

source: དཔེར་ན་སྒྱུ་མ་སྤྲུལ་པས་སྒྱུ་མ་སྤྲུལ་པ་ལ་ལུང་བསྟན་ཀྱང་སྒྱུ་མ་སྤྲུལ་པ་དེ་འདི་ལྟར་བདག་སངས་རྒྱས་སུ་འགྱུར་བར་ལུང་བསྟན་ཏོ་སྙམ་དུ་མི་སེམས་པ་དེ་བཞིན་དུ།
en: Even if one magical illusion gives a prophesy to another magical illusion, the second magical illusion does not then think, ‘I have been prophesied to become a buddha.’

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སྒྱུ་མ་སྤྲུལ་པ་ཡང་འགྱུར་བ་མ་མཆིས་པ་ལགས་སོ། །
en: Similarly, Blessed One, bodhisattvas are like magical illusions; they do not exist.

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། བྱང་ཆུབ་ནི་ཐོབ་པའི་མཚན་ཉིད་ཀྱང་མ་ལགས། དོར་བའི་མཚན་ཉིད་ཀྱང་མ་ལགས།
en: They think, ‘Awakening is not characterized by attainment, nor by rejection.

source: བྱང་ཆུབ་ནི་སྐྱེ་བའི་མཚན་ཉིད་ཀྱང་མ་ལགས། འགོག་པའི་མཚན་ཉིད་ཀྱང་མ་ལགས།
en: Awakening is not characterized by arising, nor by ceasing.

source: བྱང་ཆུབ་ནི་ལུས་ཀྱིས་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་སྟེ། སེམས་ཀྱིས་ཀྱང་མ་ལགས།
en: Awakening is not realized through the body, nor through the mind.

source: བྱང་ཆུབ་ནི་ནང་ནས་ཀྱང་མ་ལགས། སླད་རོལ་ནས་ཀྱང་མ་ལགས། གཉི་ག་མ་མཆིས་པའི་བར་ནས་ཀྱང་མི་དམིགས་ཏེ།
en: Awakening is not internal or external, nor is it observed in between.’

source: བྱང་ཆུབ་ནི་འདི་སྙམ་དུ་བདག་བྱང་ཆུབ་བོ། །
en: About awakening they think, ‘I am awakened,’ not ‘I am a realized bodhisattva.’

source: བདག་ལ་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ་སྙམ་དུ་མི་སེམས་སོ་སྙམ་པ་འདི་ནི་བཅོམ་ལྡན་འདས་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་སོ། །
en: This kind of thinking, Blessed One, is a discourse on the Dharma.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ས་རབ་ཏུ་དགའ་བ་ལ་ནི་དགའ་བ་ཡང་མ་ལགས། མི་དགའ་བ་ཡང་མ་ལགས་སོ། །
en: “Furthermore, Blessed One, bodhisattvas on the bodhisattva level Joyous are neither joyful nor not joyful.

source: དྲི་མ་མེད་པའི་ས་ལ་ནི་མི་འཕེལ་མི་འབྲིའོ། །
en: On the bodhisattva level Stainless they neither increase nor decrease.

source: འོད་བྱེད་པའི་ས་ལ་ནི་མི་རྨོངས་མི་ལྟའོ། །
en: On the bodhisattva level Luminous they are not deluded, nor do they see.

source: འོད་འཕྲོ་ཅན་གྱི་ས་ལ་ནི་མི་སྤོང་མི་འཐོབ་བོ། །
en: On the bodhisattva level Radiant they neither abandon nor obtain.

source: ཤིན་ཏུ་སྦྱང་དཀའ་བའི་ས་ལ་ནི་མི་སྐྱེ་མི་དགའོ། །
en: On the bodhisattva level Invincible they are not born, nor do they grow old.

source: མངོན་དུ་གྱུར་གྱི་ས་ལ་ནི་ཆགས་པར་ཡང་མི་འགྱུར། མི་ཆགས་པར་ཡང་མི་འགྱུར་རོ། །
en: On the bodhisattva level Facing Directly they are neither attached nor without attachment.

source: རིང་དུ་སོང་བའི་ས་ལ་ནི་མི་འགྲོ་མི་ལྡོག་གོ། །
en: On the bodhisattva level Far-Reaching they neither go nor return.

source: མི་གཡོ་བའི་ས་ལ་ནི་མི་འགུལ་མི་སྐྱོད་དོ། །
en: On the bodhisattva level Immovable they neither move nor stir.

source: ལེགས་པའི་བློ་གྲོས་ཀྱི་ས་ལ་ནི་མི་འགྲུབ་མི་སྒྲུབ་བོ། །
en: On the bodhisattva level Auspicious Intellect they neither accomplish nor perfect.

source: ཆོས་ཀྱི་སྤྲིན་གྱི་ས་ལ་ནི་མི་རྟོགས་རྟོགས་པར་མི་བགྱིད་དོ། །
en: On the bodhisattva level Cloud of Dharma they are not realized, nor do they bring about realization.

source: སངས་རྒྱས་ཀྱི་ས་ལ་ནི་ཐམས་ཅད་མཛད་ཀྱང་རྩོམ་པ་ཐམས་ཅད་མི་མངའ་སྟེ།
en: And on the ground of buddhahood they do everything without undertaking anything.

source: དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་ནི་ལྷུན་གྱིས་གྲུབ་པ་སྤྲོས་པ་ཐམས་ཅད་མི་མངའ་བ་ཞེས་བགྱིའོ། །
en: Therefore, it has been said that the Thus-Gone One is spontaneously effective and lacks any conceptual elaboration.

source: བཅོམ་ལྡན་འདས་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྟོན་པ་ལ་དབང་འཐོབ་སྟེ།
en: “Blessed One, bodhisattvas who have this kind of wisdom attain mastery in teaching.

source: སྟོན་པ་ལ་དབང་བ་དེས་བརྗོད་པ་ཐམས་ཅད་ལ་མི་ཆགས་སོ། །
en: Due to their mastery in teaching they are not attached to any statement.

source: རྣམ་པར་དག་པ་ལ་དབང་འཐོབ་སྟེ། དེས་ཐམས་ཅད་དུ་ཀུན་ནས་ཉོན་མི་མོངས་སོ། །
en: They attain mastery in purification, through which they are completely undefiled.

source: སྤོབས་པ་ལ་དབང་འཐོབ་སྟེ། དེས་རྒྱུན་དུ་ཆོས་ཀྱི་ཚུལ་རེ་རེ་བརྩམས་ནས་བསྐལ་པ་བརྒྱ་སྟོང་དུ་སྟོན་ཀྱང་ཡོངས་སུ་མི་བས་སོ། །
en: They attain mastery in confident eloquence, due to which they never tire even after continuously pursuing each and every way of the Dharma and teaching on them for a hundred thousand eons.

source: ཡེ་ཤེས་ལ་དབང་འཐོབ་སྟེ། དེས་ཆོས་ཀྱི་ཚིག་རེ་རེ་ལས་རྣམ་པ་བརྒྱ་སྟོང་དུ་སྟོན་ཏོ། །
en: They attain mastery in wisdom, through which they reveal a hundred thousand points in every word of the Dharma.

source: སྐྱེ་བ་ལ་དབང་འཐོབ་སྟེ། དེས་གང་དང་གང་དུ་སེམས་ཅན་གྱི་དོན་དུ་འགྱུར་བ་དེ་དང་དེར་སྐྱེའོ། །
en: They attain mastery over birth, through which they take birth anywhere there are beings they can help.

source: ཏིང་ངེ་འཛིན་ལ་དབང་འཐོབ་སྟེ། དེས་སེམས་ཀྱི་སྐད་ཅིག་གི་སེམས་ཀྱི་སྐད་ཅིག་ལ་ཇི་ལྟ་ཇི་ལྟ་བུར་འཚལ་བ་དེ་ལྟ་དེ་ལྟ་བུར་སྙོམས་པར་འཇུག་གོ། །
en: They attain mastery in samādhi, through which they achieve meditative attainment in whatever manner they wish in every moment of mind.

source: བྱིན་གྱིས་རླབས་ལ་དབང་འཐོབ་སྟེ། དེས་རི་དགས་དང་། བྱ་དང་རྩྭ་དང་ཤིང་དང་རྩིག་པ་ཡང་རུང་སྟེ། ཇི་ལྟར་བྱིན་གྱིས་བརླབས་པ་དེ་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སྟོན་ཏོ། །
en: They attain mastery over support, through which they demonstrate the qualities of buddhahood through any support that is appropriate, be it as a beast, a bird, grass, a tree, or a wall.

source: གཡོག་ལ་དབང་འཐོབ་སྟེ། དེས་གཡོག་མང་པོ་དང་། གཡོག་མི་ཕྱེད་པར་འགྱུར་རོ། །
en: They attain mastery over attendants, through which they will have many dedicated servants.

source: ལྟ་བ་ལ་དབང་འཐོབ་སྟེ། དེས་ཡིད་དུ་མི་མཆི་བ་མི་མཐོང་ངོ་། །
en: They attain mastery over seeing, due to which they do not see anything unattractive.

source: ཉན་པ་ལ་དབང་འཐོབ་སྟེ། དེས་རྣར་མི་མཆི་བ་མི་ཐོས་སོ། །
en: They attain mastery over hearing, due to which they do not hear anything discordant.

source: མནོམ་པ་ལ་དབང་འཐོབ་སྟེ། དེས་དྲི་ཐམས་ཅད་ཆོས་ཀྱི་དྲི་ཉིད་དུ་མནོམ་མོ། །
en: They attain mastery over smell, due to which all scents smell like the Dharma itself.

source: ལྕེ་ལ་དབང་འཐོབ་སྟེ། དེས་ཆོས་ཀྱི་ཟས་སུ་འགྱུར་གྱི། ཟང་ཟིང་གི་ཟས་སུ་ནི་མ་ལགས་སོ། །
en: They attain mastery over taste, through which they become the food of the Dharma, not material food.

source: ལུས་ལ་དབང་འཐོབ་སྟེ། དེས་ཆོས་ཀྱི་སྐུར་འགྱུར་གྱི། ཟང་ཟིང་གི་ལུས་སུ་མ་ལགས་སོ། །
en: They attain mastery over the body, through which they become the body of the Dharma, not the material body.

source: སེམས་ལ་དབང་འཐོབ་སྟེ། དེས་སེམས་ཅན་ཐམས་ཅད་ལ་ཐ་ན་སྦྲང་བུ་དང་། གྲོག་མ་རྣམས་ཀྱི་སེམས་དང་སྤྱོད་པ་ཡང་རབ་ཏུ་འཚལ་ཏེ།
en: They attain mastery over the mind, through which they understand the minds and behaviors of all beings, down to flies and ants.

source: བཅོམ་ལྡན་འདས་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ཞེས་བགྱིའོ། །
en: Blessed One, this is a discourse on the Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་དགས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་གང་སེམས་ཅན་རྣམས་ཀྱིས་མཐོང་མ་ཐག་ཏུ་དགའ་བར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་བསྒྲུབ་པར་བགྱིའོ། །
en: The bodhisattva Priyadarśana next addressed the Blessed One: “Blessed One, a bodhisattva should achieve anything that pleases beings the moment they see it.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་བགྱི་བ་གཞན་མ་མཆིས་ཀྱི། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བར་བས་ཏེ།
en: Because, Blessed One, there is no other action for a bodhisattva to take other than that which ripens beings.

source: བཅོམ་ལྡན་འདས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྩ་བའི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་སོ། །
en: This, Blessed One, is a foundational discourse on the Dharma of a bodhisattva.

source: བཅོམ་ལྡན་འདས་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བར་བགྱི་བའི་ཆོས་རྣམས་ལ་འཇུག་པར་བགྱིའོ། །
en: Blessed One, a bodhisattva therefore engages with phenomena that bring joy.

source: བཅོམ་ལྡན་འདས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགའ་བར་བགྱི་བའི་ཆོས་བཞི་སྟེ།
en: “Blessed One, there are four dharmas that bring joy to bodhisattvas.

source: བཞི་གང་ཞེ་ན།
en: What are the four?

source: ལན་དུ་ཕན་འདོགས་པ་ལ་མི་རེ་བའི་སྦྱིན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་ཀྱིས་སྙན་པར་སྨྲ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་མ་ལགས་པ་སེལ་ཅིང་དོན་སྒྲུབ་པའི་དོན་སྦྱོར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་དགའ་བའི་བདག་ཉིད་ཀྱི་དོན་འཐུན་པ་སྟེ།
en: Giving without expecting anything in return, speaking pleasantly with a mind that regards all beings equally, dispensing with what is meaningless to beings and pursuing meaningful goals, and aligning themselves with purposes that are innately joyful for beings.

source: ཆོས་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགའ་བར་བགྱི་བའོ། །
en: These four dharmas bring joy to bodhisattvas.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགའ་བར་བགྱི་བའི་ཆོས་བཞི་སྟེ།
en: “There are another four dharmas that bring joy to bodhisattvas.

source: ང་རྒྱལ་མ་མཆིས་པའི་མང་དུ་ཐོས་པ་དང་། ཟང་ཟིང་མ་མཆིས་པའི་སེམས་ཀྱིས་ཆོས་སྟོན་པ་དང་། ཡེ་ཤེས་ཚོལ་བས་བླ་མ་ལ་གུས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་དོན་དུ་གཉེར་བས་བརྩོན་འགྲུས་བརྩམས་པ་སྟེ།
en: Engaging in a lot of study without being prideful, teaching the Dharma with a mind free of material concerns, revering their master by seeking wisdom, and applying diligence in their efforts to ripen all beings.

source: ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པས་ཆོས་སྦྱིན་པ་དང་། འདོད་པ་ཉུང་བས་དབེན་པ་ལ་གནས་པ་དང་། དབེན་པར་གནས་པས་བསམ་གཏན་ཐོབ་པ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དུ་འཇུག་པས་སྤྱོད་ལམ་མི་འཁྲུགས་པ་སྟེ།
en: Giving the Dharma through perfect discipline, living in solitude with few desires, obtaining meditative concentration while living in solitude, and not disrupting their conduct by entering into villages, cities, and market towns.

source: བདེན་པར་སྨྲ་བས་སྤོབས་པ་དང་། ཆོས་སྨྲ་བས་སྟོང་པ་ཉིད་བརྗོད་པ་དང་། བཟོད་པ་སྨྲ་བས་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་དང་། འདུལ་བ་སྨྲ་བས་དབང་པོ་སྡོམ་པ་སྟེ།
en: Having confident eloquence by speaking truthfully, expressing emptiness by speaking the Dharma, regarding all beings equally by speaking about patience, and controlling their faculties by speaking about restraint.

source: ལེགས་དགུ་མཆིས་པས་གསོང་པོར་སྨྲ་བ་དང་། ངན་ངོན་ཙམ་གྱིས་ཆོག་པར་འཛིན་པས་མགུ་སླ་བ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བགྱིད་པས་གཡོ་མ་མཆིས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མི་སླུ་བས་སྒྱུ་མ་མཆིས་པ་སྟེ།
en: Speaking sincerely by remaining positive, being content by being satisfied with simple things, being undeceiving by acting in accord with their pronouncements, and being guileless by not deceiving any being.

source: ནང་ཞི་བས་གནོད་པར་མི་སེམས་པ་དང་། ཕྱི་རོལ་ཏུ་ཕྱིན་ཅི་མ་ལོག་པས་མ་རྨོངས་པ་དང་། དངོས་པོ་ཐམས་ཅད་ལ་མི་རྟག་པར་སོ་སོར་རྟོག་པས་མི་བརྐམ་པ་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པས་མ་ཁེངས་པ་སྟེ།
en: Not being malicious due to their inner calm, not being deluded due to not being mistaken about the external, not being covetous due to realizing the impermanence of all material things, and not being arrogant due to correctly understanding how things are.

source: ཟབ་པ་ཡང་ལགས་ལ་གསོང་པོར་ཡང་སྨྲ་བ་དང་། སྲེད་པ་ཡང་མ་མཆིས་ལ་མཉེན་ཞིང་སྙན་པར་ཡང་སྨྲ་བ་དང་། ལྟ་བ་ཡང་མ་མཆིས་ལ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱང་མི་འདོར་བ་དང་། དོན་དམ་པ་སྤྱོད་ཡུལ་བ་ཡང་ལགས་ལ་ཀུན་རྫོབ་ཀྱི་བསླབ་པའི་རྗེས་སུ་ཡང་འཇུག་པ་སྟེ།
en: Being profound while speaking sincerely, having no craving while speaking gently and pleasantly, not holding a view while not forsaking the mind intent on awakening, and remaining in the scope of the ultimate while following conventional training.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་དོན་དམ་པའི་སྟོང་པ་ཉིད་ཀྱིས་ངེས་པར་བྱུང་བ།
en: “Furthermore, Blessed One, bodhisattvas find release through the emptiness of the ultimate.

source: མངོན་པར་ཤེས་པ་ཆེན་པོ་དང་རིག་པས་ངེས་པར་བྱུང་བ།
en: They find release through the great higher cognition and through knowledge.

source: དབང་ཆེན་པོ་ཐོབ་པ། ཆོས་ཡང་དག་པར་རྗོད་པ་ལ་མཁས་པ། ཆོས་ཟབ་མོ་ལ་དགའ་བ། སེམས་ཅན་ཐམས་ཅད་དང་འཐུན་པར་འཇུག་པ། བསམ་གྱིས་མི་ཁྱབ་ཅིང་རྨད་དུ་བྱུང་བའི་ཆོས་དང་ལྡན་པ།
en: They have attained great power, are skilled in Dharma discourse, take joy in the profound Dharma, act in ways that align with all beings, and have qualities that are inconceivable and astonishing.

source: ཅང་ཤེས་ཀྱི་ཆོས་ཐོབ་པ། མངོན་པར་ཤེས་པ་ཆེན་པོ། ཆོས་སྨྲ་བ་ཆེན་པོ། ཆོས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ། བགྱི་བ་ཆེན་པོ་བགྱིད་པ།
en: They have acquired the most refined qualities, possess the great higher cognition, are great Dharma reciters, are great kings of the Dharma, engage in great deeds, support great people, and revel in their great higher cognition.

source: སྐྱེ་བོ་ཆེན་པོ་རྟེན་པ། མངོན་པར་ཤེས་པ་ཆེན་པོས་རྣམ་པར་རྩེན་པ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ་འཆི་འཕོ་མ་མཆིས་ཀྱང་སྐྱེ་ལ། སྐྱེ་བ་མ་མཆིས་ཀྱང་འཆི་བ།
en: In order to ripen beings, they take birth without dying and die without taking birth.

source: བགྱི་བ་བགྱིས་ཀྱང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ།
en: Even though they engage in actions, they are perfectly awakened.

source: སེམས་གྲོལ་ཡང་བརྩོན་འགྲུས་རྩོམ་པ།
en: Their minds are liberated, and yet they still make effort.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་སྤྱོད་པ་ངོམས་ཀྱང་ཚོལ་བ།
en: They have passed into final nirvāṇa, and yet still act. They are satisfied, yet still seek.

source: དོན་དུ་གཉེར་བ་མ་མཆིས་ཀྱང་སྦྱོར་བ་ཐམས་ཅད་ཤེས་ཀྱང་གཞན་ལ་འདྲི་བ་ལགས་སོ། །
en: They do not strive, yet still practice. They know all, yet still pose questions to others.

source: བཅོམ་ལྡན་འདས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་གཏིང་ནི་རྟོགས་པར་རྔོ་ཐོགས་ཀྱི། སེམས་ཅན་ཆེན་པོ་དེ་དག་གི་ཐེག་པ་ཆེན་པོའི་ཡེ་ཤེས་ཀྱི་རྒྱ་མཚོའི་གཏིང་ནི་རྟོགས་པར་རྔོ་མི་ཐོགས་སོ། །
en: “Blessed One, it is possible to determine the depths of all the oceans, but it is impossible to determine the depth of the ocean of wisdom about the Great Vehicle possessed by these great beings.

source: བཅོམ་ལྡན་འདས་ནམ་མཁའ་ནི་གཞལ་བར་རྔོ་ཐོགས་ཀྱི། སེམས་ཅན་ཆེན་པོ་དེ་དག་གི་སེམས་ནི་གཞལ་བར་རྔོ་མི་ཐོགས་སོ། །
en: Blessed One, it is possible to measure the sky, but it impossible to measure the minds of these great beings.

source: བཅོམ་ལྡན་འདས་རླུང་ནི་གཟུང་བར་རྔོ་ཐོགས་ཀྱི། སེམས་ཅན་ཆེན་པོ་དེ་དག་གི་ཡུལ་ནི་སྤྱོད་པར་རྔོ་མི་ཐོགས་སོ། །
en: Blessed One, it is possible to catch the wind, but it is impossible to act within the scope of these great beings.

source: བཅོམ་ལྡན་འདས་སྨིག་རྒྱུ་ལ་ནི་ཆུ་རྙེད་པར་རྔོ་ཐོགས་ཀྱི། སེམས་ཅན་ཆེན་པོ་དེ་དག་ལས་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ནི་རྙེད་པར་རྔོ་མི་ཐོགས་ཏེ།
en: Blessed One, it is possible to find water in a mirage, but it is impossible to find any clinging to ‘I’ or ‘mine’ in these great beings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་མིག་བཟངས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་སེམས་ལས་ཆོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བགྱིའོ། །
en: The bodhisattva Sunetra next addressed the Blessed One: “Blessed One, a bodhisattva understands all phenomena by means of the mind set on awakening.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་ཡོངས་སུ་རྟོག་པའི་སྙིང་པོ་ཙམ་དུ་བས་ཏེ།
en: Blessed One, it is because all phenomena are nothing more than fabricated concepts.

source: སེམས་ཙམ་མོ་རྫས་མ་ལགས་པའོ། །རྫས་མ་མཆིས་པའོ། །སྒྱུ་མ་ལྟར་རྩ་བ་མ་མཆིས་པའོ། །
en: They are nothing more than mind—insubstantial, immaterial, and like an illusion they have no core.

source: འདོད་པས་རྣམ་པར་བསྒྲུབས་པའོ། །བྱེད་པ་པོ་དང་ཚོར་བ་པོ་དང་བྲལ་བའོ། །
en: They are produced through desire, lacking both a creator and experiencer.

source: མི་གནས་པའོ། །གནས་པ་དང་བྲལ་བའོ། །
en: They do not persist and are baseless.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་ཐོག་མ་དང་ལྡན་པ་མ་ལགས་པའོ། །
en: Blessed One, all phenomena are beginningless.

source: གཉིས་སུ་མ་མཆིས་པའོ། །གཉིས་དང་བྲལ་བའོ། །
en: They are not dual, but they are free of duality.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་ངའི་བ་མ་མཆིས་པ། ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པའོ། །
en: Blessed One, there is no ‘I’ in any phenomena, there is no grasping.

source: ཆོས་ཐམས་ཅད་ནི་བདག་པོ་མ་མཆིས་པ། ཆོས་ཀྱི་དབྱིངས་དང་མཉམ་པའོ། །
en: There is no governing power in any phenomena; they are equivalent to the expanse of phenomena.

source: ཆོས་ཐམས་ཅད་ནི་གློ་བུར་དུ་བྱུང་བ། མི་གནས་པ། འདོད་ཆགས་དང་བྲལ་བའོ། །
en: All phenomena are adventitious, do not persist, and are free of desire.

source: ཆོས་ཐམས་ཅད་ནི་ཀུན་དུ་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་བྲལ་བ། རྟོག་པ་སེལ་བ་དང་བྲལ་བའོ། །
en: All phenomena are free of constructs and concepts, and they are free of the elimination of concepts.

source: ཆོས་ཐམས་ཅད་ནི་ཤེས་པར་བགྱི་བ་ཙམ་དང་། ཤེས་པ་པོ་སྟོང་པའི་ཕྱིར་བླང་དུ་མ་མཆིས།
en: All phenomena, because they are merely knowable and devoid of a knower, cannot be accepted.

source: བཀུར་དུ་མ་མཆིས་ཏེ། ཡོངས་སུ་འཚལ་བར་བགྱི་བ་ཙམ་དུ་བས་ན། འདི་ལ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་བདག་མ་མཆིས་པ་རྣམས་ལ་བདག་ཏུ་འདུ་ཤེས།
en: Phenomena cannot be taken seriously, but because they can at least be conceived of, ordinary foolish beings perceive a self in them when there is no self.

source: སེམས་ཅན་མ་མཆིས་པ་རྣམས་ལ་སེམས་ཅན་དུ་འདུ་ཤེས་པ་འདི་དག་ཆོས་ཉིད་འདི་ལྟ་བུ་འདི་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་ནས། བྱང་ཆུབ་སེམས་དཔའ་གང་སེམས་སྐྱེ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཀྱི་སེམས་ཞེས་བགྱིའོ། །
en: “A bodhisattva’s generation of the mind set on awakening refers to the mind that is generated when a bodhisattva thinks, ‘I need to understand the fact that beings are perceived where there are no beings.’

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་སེམས་དང་། བདེ་བའི་སེམས་དང་། བླ་ན་མེད་པའི་སེམས་དང་། ཆོས་ཀྱི་དབྱིངས་ལས་སྐྱེས་པའི་སེམས་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ལ་བརྟེན་ནས་སྐྱེས་པ་འདི་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཞེས་བགྱིའོ། །
en: The mind set on awakening is generated based on a mind that seeks to be of benefit to beings, a mind that is positive, unsurpassable, that arises from the expanse of phenomena, and that relies on all the realms of beings.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཉེ་བར་ཞི་བའི་སེམས་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཞི་བའི་སེམས་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རྨ་མི་ཕྱིན་པའི་སེམས་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཕྱིར་མི་ལྡོག་པའི་སེམས་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རྣམ་པར་མི་གཡེང་བའི་སེམས་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རྣམ་པར་རྟོག་པའི་སེམས་དང་།
en: Blessed One, a bodhisattva’s generation of the mind set on awakening refers to the mind that is pacified through the perfection of generosity, that is calmed through the perfection of discipline, that is unwounded due to the perfection of patience, that is irreversible due to the perfection of diligence, that is undistracted due to the perfection of meditative stability , and that is nonconceptual due to the perfection of insight.

source: བྱམས་པས་མཉན་པའི་སེམས་དང་། སྙིང་རྗེ་ཆེན་པོས་མི་ཟློག་པའི་སེམས་དང་། དགའ་བ་ཆེན་པོས་འགྱོད་པ་མ་མཆིས་པའི་སེམས་དང་། བཏང་སྙོམས་ཆེན་པོས་དྲི་མ་མ་མཆིས་པའི་སེམས་དང་།
en: It refers to the mind that has been made gentle by love, enduring by compassion, free of regrets by joy, and stainless by great equanimity.

source: སྦྱིན་པས་འཇུངས་པ་མ་མཆིས་པའི་སེམས་དང་།
en: It refers to the mind made free of greed by generosity.

source: སྙན་པར་སྨྲ་བས་ཐིབས་པོ་མ་མཆིས་པའི་སེམས་དང་།
en: It refers to the mind that, due to pleasant speech, is not obtuse.

source: དོན་སྤྱོད་པས་མཉམ་པའི་སེམས་དང་།
en: It refers to the mind in equanimity due to meaningful conduct.

source: དོན་འཐུན་པས་ལྟག་ནམ་མཆིས་པའི་སེམས་དང་།
en: It refers to the mind that is unsurpassed because it is consistent with the bodhisattva’s deeds.

source: སྟོང་པ་ཉིད་ཀྱིས་མི་འགྱུར་བའི་སེམས་དང་། མཚན་མ་མ་མཆིས་པས་སྒྲིབ་པ་མ་མཆིས་པའི་སེམས་དང་། སྨོན་པ་མ་མཆིས་པས་མི་གཡེང་བའི་སེམས་དང་།
en: It refers to the mind that is unchanging due to emptiness, unobscured due to signlessness, and undistracted due to wishlessness.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱིས་ངེས་པར་འབྱུང་བའི་སེམས་དང་།
en: It refers to the mind that is released through the factors of awakening.

source: སངས་རྒྱས་རྗེས་སུ་དྲན་པས་མི་ཕྱེད་པའི་སེམས་དང་། ཆོས་རྗེས་སུ་དྲན་པས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སེམས་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པས་སྨོན་པ་མ་མཆིས་པའི་སེམས་དང་།
en: It refers to the mind that is indivisible due to the recollection of the Buddha, is aligned with the expanse of phenomena due to the recollection of the Dharma, and is wishless due to the recollection of the Saṅgha.

source: ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པས་མཆོག་ཏུ་འཛིན་པ་མ་མཆིས་པའི་སེམས་དང་།
en: It refers to the mind that, by recollecting discipline, does not consider itself superior.

source: གཏོང་བ་རྗེས་སུ་དྲན་པས་ཆགས་པ་མ་མཆིས་པའི་སེམས་དང་།
en: It refers to the mind that, by recollecting giving, is not attached.

source: ལྷ་རྗེས་སུ་དྲན་པས་དགེ་བའི་ཚོགས་ཐམས་ཅད་ཡང་དག་པར་འགྲུབ་པའི་སེམས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་སེམས་ཞེས་བགྱིའོ། །
en: And it refers to the mind that, by recollecting the gods, has mastered the multitude of virtues.

source: བཅོམ་ལྡན་འདས་བདག་གིས་བྱང་ཆུབ་ཀྱི་སེམས་ལས་བརྩམས་ཏེ། བསྐལ་པའམ་བསྐལ་པ་ལས་ལྷག་པར་བསྟན་ཀྱང་མཐའ་རྟོགས་པར་མི་འགྱུར་རོ། །
en: “Blessed One, if I began teaching on the mind set on awakening and continued for an eon or more, I would not reach the end.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པ་ནི་ཚད་མ་མཆིས་པའི་རྒྱུ་ལས་བྱུང་བ་ལགས་སོ། །
en: Blessed One, this is what it means that the bodhisattva’s generation of the mind set on awakening arises from unquantifiable causes.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཀྱི་སེམས་ལས་དགེ་བའི་ཆོས་ཐམས་ཅད་གཟུང་བར་བགྱི་སྟེ།
en: Blessed One, a bodhisattva should therefore take hold of all the virtuous qualities that come from the mind set on awakening.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལེགས་པར་སྐྱེས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་རྩ་བ་ཡོངས་སུ་དག་པས་མ་སྐྱེས་པའོ། །
en: The bodhisattva Sujāta next addressed the Blessed One: “Blessed One, because their root is pure, no phenomena arise.

source: བཅོམ་ལྡན་འདས་དེ་ལ་ཆོས་རྣམས་ཀྱི་རྩ་བ་ཅི་ལགས་ཞེ་ན།
en: What then is the root of phenomena?

source: མངོན་པར་མ་ཞེན་པ་ནི་ཆོས་རྣམས་ཀྱི་རྩ་བའོ། །
en: The root of phenomena is to be unattached.
